; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v5 - type_1)
 	      (pred_3 ?v3 - object ?v5 - type_1)
	      (pred_1 ?v6 - type_2 ?v2 - type_3)
	      (pred_2 ?v6 - type_2 ?v3 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_4 ?v6 ?v1))
       :effect (and  (pred_4 ?v6 ?v8)
		     (not (pred_4 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_2 ?v7 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v4) (pred_4 ?v6 ?v4) (pred_1 ?v6 ?v2))
       :effect (and (pred_2 ?v6 ?v7 ?v2)
		    (not (pred_3 ?v7 ?v4)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_2 ?v7 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v2) (pred_4 ?v6 ?v4))
       :effect (and (pred_3 ?v7 ?v4)
		    (pred_1 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v7 ?v2)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_09 obj_03 - type_2
obj_10 obj_05 obj_01 obj_08 - type_3
obj_02 obj_11 obj_04 - type_1
obj_07 obj_06 - object)
(:init
(pred_4 obj_09 obj_11)
(pred_1 obj_09 obj_10)
(pred_1 obj_09 obj_05)
(pred_4 obj_03 obj_02)
(pred_1 obj_03 obj_01)
(pred_1 obj_03 obj_08)
(pred_3 obj_07 obj_02)
(pred_3 obj_06 obj_02)
)
(:goal
(and
(pred_3 obj_07 obj_11)
(pred_3 obj_06 obj_02)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_09 obj_11) (pred_4 obj_03 obj_11))))
  )
)
)

; plan
1. (op_2 obj_03 obj_07 obj_02 obj_08)
   deleted: (pred_3 obj_07 obj_02) (pred_1 obj_03 obj_08)
   added: (pred_2 obj_03 obj_07 obj_08)
   goals met: 1 of 2
2. (op_3 obj_09 obj_11 obj_02)
   deleted: (pred_4 obj_09 obj_11)
   added: (pred_4 obj_09 obj_02)
   goals met: 1 of 2
3. (op_3 obj_03 obj_02 obj_11)
   deleted: (pred_4 obj_03 obj_02)
   added: (pred_4 obj_03 obj_11)
   goals met: 1 of 2
4. (op_1 obj_03 obj_07 obj_11 obj_08)
   deleted: (pred_2 obj_03 obj_07 obj_08)
   added: (pred_3 obj_07 obj_11) (pred_1 obj_03 obj_08)
   goals met: 2 of 2
